[
  {
    "name": "Sophia Carter",
    "comment": "<p>Outstanding support! My assignment was delivered on time with great quality. The team ensured I understood every step and even broke down complex problems for me. My professor praised the work, and I couldn’t be happier. I’ll definitely use their services again!</p>",
    "rating": 5,
    "datedOn": "2024-07-15"
  },
  {
    "name": "James Bennett",
    "comment": "<p>Thanks to their help, I got an A+ on my project! The step-by-step approach made everything easy to follow, and they went above and beyond to ensure it was perfect. Highly recommend Assignment Bros to any student needing reliable support.</p>",
    "rating": 5,
    "datedOn": "2024-06-10"
  },
  {
    "name": "Olivia Martinez",
    "comment": "<p>Incredible service! They helped me tackle tough problems and made sure I understood everything. Their clear explanations and patience were amazing. I got a great score and feel more confident handling assignments now. Highly recommend them!</p>",
    "rating": 4.8,
    "datedOn": "2024-06-08"
  },
  {
    "name": "Ethan Smith",
    "comment": "<p>Assignment Bros saved me from a tight deadline! They delivered fast, explained the solutions clearly, and gave tips to improve my skills. I scored top marks and had a stress-free experience. Fantastic support!</p>",
    "rating": 4.9,
    "datedOn": "2024-08-21"
  },
  {
    "name": "Isabella Johnson",
    "comment": "<p>Professional and timely! They delivered excellent work ahead of schedule, with clear explanations and great formatting. My professor was impressed, and I was thrilled with the result. I’ll be using their services again for sure!</p>",
    "rating": 5,
    "datedOn": "2024-10-14"
  },
  {
    "name": "Liam Wilson",
    "comment": "<p>Top-notch work! Their explanations were clear, and the formatting was flawless. They answered all my questions and even gave tips to improve my understanding. Highly recommend their services to any student in need!</p>",
    "rating": 4.7,
    "datedOn": "2024-10-18"
  },
  {
    "name": "Mia Davis",
    "comment": "<p>Assignment Bros was a lifesaver! Their step-by-step guidance and flawless delivery helped me score higher than I expected. The team was supportive and made the process stress-free. Thank you for the amazing service!</p>",
    "rating": 5,
    "datedOn": "2024-11-03"
  },
  {
    "name": "William Brown",
    "comment": "<p>Exceptional service! They explained everything clearly and delivered quality work on time. My professor loved it, and I felt more confident in my subject. Highly recommend Assignment Bros for any academic help.</p>",
    "rating": 4.9,
    "datedOn": "2024-09-22"
  },
  {
    "name": "Emily White",
    "comment": "<p>Fantastic support! They made complex concepts easy to understand and delivered everything on time. I got a perfect grade, and my professor was impressed. Assignment Bros is my go-to for academic help now!</p>",
    "rating": 5,
    "datedOn": "2024-09-10"
  },
  {
    "name": "Lucas Green",
    "comment": "<p>Outstanding support! They clarified my doubts and delivered detailed solutions. My professor praised my work, and I got a great grade. I’m so grateful for their help and highly recommend them!</p>",
    "rating": 4.8,
    "datedOn": "2024-10-06"
  }
]
